# coding: UTF-8
# 문제: 모스 부호 해석해서 한 문장으로 출력하기

# 모스부호
morse = {
    '.-':'A','-...':'B','-.-.':'C','-..':'D','.':'E','..-.':'F',
    '--.':'G','....':'H','..':'I','.---':'J','-.-':'K','.-..':'L',
    '--':'M','-.':'N','---':'O','.--.':'P','--.-':'Q','.-.':'R',
    '...':'S','-':'T','..-':'U','...-':'V','.--':'W','-..-':'X',
    '-.--':'Y','--..':'Z'
}
 
# 풀어야할 암호
code = '.... .  ... .-.. . . .--. ...  . .- .-. .-.. -.--'

# Write your code below.
split_code = code.split()

# res = [] 

for co in split_code:
    # res.append(morse.get(co))
    print(morse.get(co), end=" ")

# print(res)