# coding: UTF-8
# 문제: 모스 부호 해석해서 한 문장으로 출력하기

# 모스부호
morse = {
    '.-':'A','-...':'B','-.-.':'C','-..':'D','.':'E','..-.':'F',
    '--.':'G','....':'H','..':'I','.---':'J','-.-':'K','.-..':'L',
    '--':'M','-.':'N','---':'O','.--.':'P','--.-':'Q','.-.':'R',
    '...':'S','-':'T','..-':'U','...-':'V','.--':'W','-..-':'X',
    '-.--':'Y','--..':'Z'
}
 
# 풀어야할 암호
code = '.... .  ... .-.. . . .--. ...  . .- .-. .-.. -.--'

# Write your code below.
for line in code.split("  "):
	for char in line.split():
		print(morse.get(char), end="")
	print(end=" ")